#Вводим элементы геометрической прогрессии.
b = int(input("Здравствуйте.Введите первый элемент прогрессии:"))
q = int(input("Введите множитель прогрессии:"))
n = int(input("Ведите номер последнего элемента:"))
if b>= -10000 and b<= 10000 and q<=50 and q>=1  and n>=2 and n<=100:  #Условие для элементов прогрессии.
    print("Сумма геометрической прогрессии:", (b*(1-q**n))/(1-q))   #вывод суммы геометрической прогрессии.
else:
    print("Ошибка в переменной") #Ошибка если переменная не соответствует данному условию. 