n=int(input("Введите число от 1 до 25:")) #Вводим элемент n
A=0
if n>= 1 and n<=25:
    for i in range(2,n):
        if n%i ==0: #Проверка делится ли n на числа которые стоят перед ним без остатка
            A+=1
    if A==0: #Если у числа нет делителя значит A останется 0 тогда это простое число
        print(n," Y")
    else: #Если у числа есть делитель то A станет 1 тогда это не простое число
        print(n," N")
else: #Если число не входит в заданный диапозон
    print("n не входит в диапозон.")   